app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
---
      <tr>
        <td><%= group.group_id %></td>