app/controllers/groups_controller.rb

INSERT INTO "groups" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-02 18:41:41.653057"], ["group_id", 2], ["updated_at", "2014-06-02 18:41:41.653057"], ["user_id", 2]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "group_id" = ?, "updated_at" = ? WHERE "groups"."id" = 1  [["group_id", 1], ["updated_at", "2014-06-02 18:41:09.711057"]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)