app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "poster_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "this is my post"], ["created_at", "2014-06-02 16:50:25.720057"], ["poster_name", "Dave Huff"], ["updated_at", "2014-06-02 16:50:25.720057"], ["user_id", 0]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save